Repository: Grisshink/scrap
Catalog: translations/*/LC_MESSAGES/scrap.po
Languages: kk, ru

source: Hello, scrap!
kk: Сәлем, scrap!
ru: Привет, мусороид!

source: Control
kk: Бақылау
ru: Управление

source: Terminal
kk: Терминал
ru: Терминал

source: Math
kk: Математика
ru: Математика

source: Logic
kk: Логика
ru: Логика

source: Strings
kk: Жолдар
ru: Строки

source: Misc.
kk: Әртүрлі.
ru: Другое

source: Data
kk: Данные
ru: Данные

source: When
kk: Қашан
ru: Когда

source: clicked
kk: басылды
ru: нажат

source: Loop
kk: Цикл
ru: Цикл

source: Repeat
kk: Қайталау
ru: Повторить

source: times
kk: рет
ru: раз

source: While
kk: Әзірге
ru: Пока

source: If
kk: Егер
ru: Если

source: , then
kk: , содан кейін
ru: , то

source: Else if
kk: Әйтпесе, егер
ru: Иначе если

source: Else
kk: Басқа
ru: Иначе

source: Do nothing
kk: Ештеңе жасама
ru: Делать ничего

source: Sleep
kk: Ұйқы
ru: Ждать

source: μs
kk: мкс
ru: мкс

source: Define
kk: Анықтаңыз
ru: Определить

source: Return
kk: Қайту
ru: Вернуть

source: Get input
kk: Кіріс алыңыз
ru: Получить ввод

source: Get char
kk: Шарды алыңыз
ru: Получить символ

source: Print
kk: Басып шығару
ru: Напечатать

source: Print line
kk: Басып шығару сызығы
ru: Напечатать линию

source: Cursor X
kk: Меңзер X
ru: X курсора

source: Cursor Y
kk: Меңзер Y
ru: Y курсора

source: Terminal width
kk: Терминал ені
ru: Ширина терминала

source: Terminal height
kk: Терминал биіктігі
ru: Высота терминала

source: Set cursor X:
kk: курсорын орнату X:
ru: Задать позицию курсора X:

source: Set text color
kk: Мәтін түсін орнату
ru: Задать цвет текста

source: Set background color
kk: Фон түсін орнату
ru: Задать цвет фона

source: Reset color
kk: Түсті қалпына келтіру
ru: Сбросить цвет

source: Clear terminal
kk: Терминалды тазалау
ru: Очистить терминал

source: Set clear color
kk: Ашық түсті орнатыңыз
ru: Задать цвет очистки

source: Pow
kk: Дәреже
ru: Степень

source: Not
kk: Жоқ
ru: Не

source: and
kk: және
ru: и

source: or
kk: немесе
ru: или

source: True
kk: Рас
ru: Истина

source: False
kk: Жалған
ru: Ложь

source: Random
kk: Кездейсоқ
ru: Случайное целое от

source: to
kk: дейін
ru: до

source: Join
kk: Қосылыңыз
ru: Склеить

source: left and
kk: солға және
ru: левое и

source: right
kk: дұрыс
ru: правое

source: Letter
kk: Хат
ru: Буква

source: in
kk: жылы
ru: в

source: Substring
kk: Ішкі жол
ru: Подстрока

source: Length
kk: Ұзындығы
ru: Длина

source: string
kk: жол
ru: строка

source: Time since 1970
kk: 1970 жылдан бері уақыт
ru: Время с 1970

source: Int
kk: Бүтін сан
ru: Целое

source: Float
kk: Қалқымалы
ru: Вещ-ое

source: Str
kk: Кіші әріп
ru: Строчное

source: Bool
kk: Булевое
ru: Булевое

source: Nothing
kk: Ештеңе
ru: Ничего

source: Declare
kk: Мәлімдеу
ru: Объявить

source: my variable
kk: менің айнымалым
ru: моя переменная

source: list
ru: список

source: Collect garbage
ru: Собрать мусор

source: Get
kk: Алу
ru: Получить

source: Set
kk: Орнату
ru: Задать

source: Empty list
kk: Бос тізім
ru: Пустой список

source: Add
kk: Қосу
ru: Добавить

source: value
kk: мән
ru: значение

source: get at
kk: жету
ru: получить по индексу

source: set at
kk: орнатыңыз
ru: задать по индексу

source: My block
kk: Менің блогым
ru: Мой блок

source: Type of
ru: Тип от

source: Invalid data type %s, expected %s
ru: Неверный тип данных %s, ожидался %s

source: Variable with name "%s" does not exist in the current scope
ru: Переменная с именем "%s" не существует в данном окружении

source: Assign to variable "%s" of type %s with incompatible type %s
ru: Присвоение в переменную "%s" с типом %s значением несовместимого типа %s

source: Variable declarations are not allowed inside an argument
ru: Объявления переменных запрещены внутри аргументов

source: Cannot declare variable with empty name
ru: Нельзя объявлять переменную с пустым именем

source: Tried to access index %d for list of length %d
ru: Попытка получить элемент по индексу %d для списка размером %d

source: Division by zero
ru: Деление на ноль

source: Invalid argument %s
ru: Неверный аргумент %s

source: Unknown function id "%s"
ru: Неизвестный id функции"%s"

source: Unknown argument id "%s"
ru: Неизвестный id аргумента"%s"

source: Cannot represent %s as LLVM value
ru: Невозможно представить %s как значение LLVM

source: Cannot cast type %s into %s
ru: Невозможно преобразовать тип %s в %s

source: Cannot cast type %s into any string
ru: Невозможно преобразовать тип %s в any string

source: Could not find function definition for argument
ru: Не удалось найти определение функции для аргумента

source: Function argument block used outside of function
ru: Использование блока аргумента функции вне функции

source: Too many parameters passed into function. Got %d/32
ru: Слишком много аргументов передано в функцию. Передано %d/32

source: Invalid type %s in print function
ru: Неверный тип %s в функции печати

source: Unhandled type %s in print function
ru: Необработанный тип %s в функции печати

source: Cannot declare a variable with zero sized type (i.e. Nothing)
ru: Невозможно объявить переменную с типом нулевого размера (т.е. Ничего)

source: at
ru: в

source: Code
kk: Код
ru: Код

source: Output
kk: Шығару
ru: Вывод

source: Block categories
kk: Код сәтті орындалды
ru: Категории блоков

source: Block palette
kk: Блок палитрасы
ru: Палитра блоков

source: File
kk: Файл
ru: Файл

source: Settings
kk: Параметрлер
ru: Настройки

source: About
kk: Туралы
ru: О программе

source: Jump to block
ru: Перейти к блоку

source: Close
ru: Закрыть

source: Vm executed successfully
kk: Код сәтті орындалды
ru: Код выполнен успешно

source: Vm stopped >:(
kk: Код тоқтатылды >:(
ru: Код остановлен >:(

source: Vm shitted and died :(
kk: Код бұзылды және өлді :(
ru: Код высрал и сдох :(

source: File load failed :(
kk: Файл жүктелмеді :(
ru: Загрузка файла не удалась :(

source: File load succeeded!
kk: Файл жүктелді!
ru: Загрузка файла удалась!

source: Jump to chain (%d/%d)
kk: Переход на цепочку (%d/%d)
ru: Переход на цепочку (%d/%d)

source: Start failed!
kk: Кодты бастау сәтсіз аяқталды!
ru: Запуск кода провалился!

source: Started successfully!
kk: Код сәтті басталды!
ru: Код успешно запущен!

source: New project
kk: Жаңа жоба
ru: Новый проект

source: Save project
kk: Жобаны сақтау
ru: Сохранить проект

source: Load project
kk: Жобаны жүктеңіз
ru: Загрузить проект

source: UI size
kk: Пайдаланушы интерфейсінің өлшемі
ru: Размер интерфейса

source: FPS limit
kk: FPS шегі
ru: Ограничение FPS

source: Font path
kk: Қаріп жолы
ru: Путь шрифта

source: Bold font path
kk: Қалың шрифт жолы
ru: Путь жирного шрифта

source: Monospaced font path
kk: Бір кеңістікті қаріп жолы
ru: Путь моноширинного шрифта

source: Panel editor
kk: Панель редакторы
ru: Редактор панелей

source: Open
kk: Ашық
ru: Открыть

source: Reset panels
kk: Панельдерді қалпына келтіру
ru: Сбросить панели

source: Reset
kk: Қалпына келтіру
ru: Сбросить

source: Apply
kk: Қолдану
ru: Применить

source: Needs restart for changes to take effect
kk: Өзгерістер күшіне енуі үшін қайта іске қосу қажет
ru: Требуется перезагрузка, чтобы изменения вступили в силу

source: Scrap is a project that allows anyone to build software using simple, block based interface.
ru: Scrap - это проект, который позволяет любому создавать софт, используя простой, блочный интерфейс

source: License
kk: Лицензия
ru: Лицензия

source: Build settings
ru: Настройки сборки

source: Executable name
ru: Имя приложения

source: Linker name (Linux only)
ru: Имя линковщика (только для Linux)

source: Build!
ru: Собрать!

source: Panel edit mode
kk: Панельді өңдеу режимі
ru: Режим редактирования панелей

source: Click on panels to reposition them
kk: Олардың орнын өзгерту үшін панельдерді басыңыз
ru: Нажимайте на панели чтобы их передвигать

source: Drag panel edges to resize them
kk: Өлшемдерін өзгерту үшін панель жиектерін сүйреңіз
ru: Перетягивайте края панелей, чтобы изменить размер

source: Done
kk: Дайын
ru: Готово

source: Save
kk: Сақтау
ru: Сохранить

source: any
ru: любое

source: cond.
ru: усл.

source: Abc
ru: Абв

source: path
ru: путь

source: Language
ru: Язык

source: System
ru: Системный

source: English [en]
ru: Английский [en]

source: Russian [ru]
ru: Русский [ru]

source: Kazakh [kk]
ru: Казахский [kk]

source: Ukrainian [uk]
ru: Украинский [uk]

source: UNKNOWN %s
ru: НЕИЗВЕСТНЫЙ %s

source: Control stack overflow
ru: Переполнение стека контроля

source: Variable stack overflow
ru: Переполнение стека переменных

source: Tried to compile block without definition
ru: Попытка скомпилировать блок без определения

source: Tried to compile block "%s" without implementation
ru: Попытка скомпилировать блок "%s" без реализации

source: Function with name "%s" does not exist
ru: Функции с именем "%s" не существует

source: Failed to build module: %s
ru: Не удалось собрать модуль: %s

source: Tried to execute block without definition
ru: Попытка выполнить блок без определения

source: Tried to execute block "%s" without implementation
ru: Попытка выполнить блок "%s" без реализации

source: Failed to create a pipe. Error code: %ld
ru: Не удалось создать канал. Код ошибки: %ld

source: Failed to create a process. Error code: %ld
ru: Не удалось создать процесс. Код ошибки: %ld

source: Failed to read from pipe. Error code: %ld
ru: Не удалось прочитать данные из канала. Код ошибки: %ld

source: Failed to get exit code. Error code: %ld
ru: Не удалось получить код выхода. Код ошибки: %ld

source: Linker exited with exit code: %ld
ru: Линковщик завершился с кодом ошибки: %ld

source: Failed to fork a process: %s
ru: Не удалось форкнуть процесс: %s

source: Linker signaled with signal number: %d
ru: Линковщик завершился с кодом сигнала: %d

source: Received unknown child status :/
ru: Получен неизвестный статус от дочернего процесса :/

source: Pi
kk: Пи

source: Ord
kk: Оrd

source: Scrap is a project that allows anyone to build
kk: Scrap - бұл кез келген адамға салуға мүмкіндік беретін жоба

source: software using simple, block based interface.
kk: қарапайым, блок негізіндегі интерфейсті пайдаланатын бағдарламалық қамтамасыз ету.
